Author: Bjarne Niklas Luttermann \(Matr. Nr.: 373960, TH LÃ¼beck\)

Data Science \- ESA 2

Abgabedatum: 24.04.2024

Q2: Do the following exercise in a Jupyter Notebook \(a GitHub Link would be the best\): \-\- 12pt

In [166]:
import pandas as pd
import numpy as np
import math

# formatting
pd.options.display.float_format = "{:.2f}".format

Load the countries.csv directly via URL import into your panda data frame!

In [167]:
countries_url = "countries.csv"
Countries = pd.read_csv(countries_url, delimiter=',')

# Create a DataFrame
df = pd.DataFrame(Countries)

# Display table
df

        Name  Population     Area     GDP Currency
0    Germany    82521653   357385 3466.00      EUR
1      Japan   126045000   377835 4938.00      YEN
2     Canada    36503097  9984670 1529.00      CAD
3      Italy    60501718   301338 1850.00      EUR
4   Brazilia   208360000  8515770 1798.00     REAL
5     Taiwan    23938272    36197  744.00      NTD
6  Venezuela    28208977   912050     NaN      VED

Display descriptive statistics for the numerical column \(count, mean, std, min, 25%, 50%, 75%, max\)

In [168]:
df.describe()

        Population       Area     GDP
count         7.00       7.00    6.00
mean   80868388.14 2926463.57 2387.50
std    66701952.31 4348507.10 1532.50
min    23938272.00   36197.00  744.00
25%    32356037.00  329361.50 1596.25
50%    60501718.00  377835.00 1824.00
75%   104283326.50 4713910.00 3062.00
max   208360000.00 9984670.00 4938.00

Show the last 4 rows of the data frame.

In [169]:
df.tail(4)

        Name  Population     Area     GDP Currency
3      Italy    60501718   301338 1850.00      EUR
4   Brazilia   208360000  8515770 1798.00     REAL
5     Taiwan    23938272    36197  744.00      NTD
6  Venezuela    28208977   912050     NaN      VED

Show all the rows of countries that have the EURO

In [170]:
df[df['Currency'] == 'EUR']

      Name  Population    Area     GDP Currency
0  Germany    82521653  357385 3466.00      EUR
3    Italy    60501718  301338 1850.00      EUR

Show only Name and Currency in a new data frame

In [171]:
df[['Name', 'Currency']]

        Name Currency
0    Germany      EUR
1      Japan      YEN
2     Canada      CAD
3      Italy      EUR
4   Brazilia     REAL
5     Taiwan      NTD
6  Venezuela      VED

Show only the rows/countries that have more than 2000 GDP \(it is in Milliarden USD Bruttoinlandsprodukt\)

In [172]:
df[df['GDP'] > 2000]

      Name  Population    Area     GDP Currency
0  Germany    82521653  357385 3466.00      EUR
1    Japan   126045000  377835 4938.00      YEN

Select all countries where with inhabitants between 50 and 150 Mio

In [173]:
df[(df['Population'] >= 50000000) & (df['Population'] <= 150000000)]

      Name  Population    Area     GDP Currency
0  Germany    82521653  357385 3466.00      EUR
1    Japan   126045000  377835 4938.00      YEN
3    Italy    60501718  301338 1850.00      EUR

Calculate the GDP average \(ignore the missing value\)

In [174]:
# Filter  countries  (GDP not missing)
df_filtered = df.dropna(subset=['GDP'])

# Calculate the GDP average
df_filtered['GDP'].mean()

2387.5

Calculate the GDP average \(missing value treated as 0\)

In [175]:
# Replace NaNs with 0 (column: GDP)
df['GDP'] = df['GDP'].fillna(0)

# Calculate the average GDP
df['GDP'].mean()

2046.4285714285713

Calculate the population density \(population/area\)  of all countries and add as new column

In [176]:
df['Population Density'] = df['Population'] / df['Area']

df

        Name  Population     Area     GDP Currency  Population Density
0    Germany    82521653   357385 3466.00      EUR              230.90
1      Japan   126045000   377835 4938.00      YEN              333.60
2     Canada    36503097  9984670 1529.00      CAD                3.66
3      Italy    60501718   301338 1850.00      EUR              200.78
4   Brazilia   208360000  8515770 1798.00     REAL               24.47
5     Taiwan    23938272    36197  744.00      NTD              661.33
6  Venezuela    28208977   912050    0.00      VED               30.93

Sort by country name alphabetically

In [177]:
df.sort_values('Name')

        Name  Population     Area     GDP Currency  Population Density
4   Brazilia   208360000  8515770 1798.00     REAL               24.47
2     Canada    36503097  9984670 1529.00      CAD                3.66
0    Germany    82521653   357385 3466.00      EUR              230.90
3      Italy    60501718   301338 1850.00      EUR              200.78
1      Japan   126045000   377835 4938.00      YEN              333.60
5     Taiwan    23938272    36197  744.00      NTD              661.33
6  Venezuela    28208977   912050    0.00      VED               30.93

Create a new data frame from the original where the area is changed: all countries with &gt; 1000000 get BIG and &lt;= 1000000 get SMALL in the cell replaced!

In [179]:
new_df = pd.DataFrame(Countries)
new_df["Area"] = new_df["Area"].map(lambda x: "BIG" if x > 1000000 else "SMALL")
new_df

        Name  Population   Area     GDP Currency
0    Germany    82521653  SMALL 3466.00      EUR
1      Japan   126045000  SMALL 4938.00      YEN
2     Canada    36503097    BIG 1529.00      CAD
3      Italy    60501718  SMALL 1850.00      EUR
4   Brazilia   208360000    BIG 1798.00     REAL
5     Taiwan    23938272  SMALL  744.00      NTD
6  Venezuela    28208977  SMALL     NaN      VED